app/views/users/show.html.erb

  <div>
    <% Exercise.all.each do |exercise| %>
      <%= check_box_tag "user[exercise_ids][]", exercise.id, form.object.exercises.include?(exercise) %>
---
SELECT "exercises".* FROM "exercises"
SELECT  1 AS one FROM "exercises" INNER JOIN "user_exercises" ON "exercises"."id" = "user_exercises"."exercise_id" WHERE "user_exercises"."user_id" = $1 AND "exercises"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]