app/views/shared/_progress.html.erb


<h4>Total exercises for today- <%= current_user.current_day_exercises.length%></h4>
---
SELECT "user_exercises".* FROM "user_exercises" WHERE "user_exercises"."user_id" = $1 AND "user_exercises"."exercise_id" = $2 LIMIT $3  [["user_id", 737], ["exercise_id", 570], ["LIMIT", 1]]