app/controllers/exercises_controller.rb

  def index
    # binding.pry
    if params[:exercise].present?
      @exercises= current_user.exercises.where(category: params[:exercise][:category])
---
SELECT "exercises".* FROM "exercises" INNER JOIN "users_exercises" ON "exercises"."id" = "users_exercises"."exercise_id" WHERE "users_exercises"."user_id" = $1 AND "exercises"."category" IN ($2, $3, $4)  [["user_id", 1], ["category", ""], ["category", "Back"], ["category", "Leg"]]

  def show
    @exercise= Exercise.find(params[:id])
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def change_favourite
    type= params[:type]
    # binding.pry
    user_exercise = current_user.user_exercises.find_by(exercise_id: params[:id])
    user_exercise.update(favourite: type == 'Favourite')
---
SELECT  "user_exercises".* FROM "user_exercises" WHERE "user_exercises"."user_id" = $1 AND "user_exercises"."exercise_id" = $2 LIMIT $3  [["user_id", 1], ["exercise_id", 2], ["LIMIT", 1]]
UPDATE "user_exercises" SET "favourite" = $1 WHERE "user_exercises"."id" = $2  [["favourite", true], ["id", 1]]

  def create
    @exercise= Exercise.new(exercise_params)

    if @exercise.save
---
INSERT INTO "exercises" ("name", "description", "category", "link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["description", ""], ["category", "Abs"], ["link", ""], ["created_at", "2022-05-05 13:59:52.599843"], ["updated_at", "2022-05-05 13:59:52.599843"]]

  def edit
      @exercise= Exercise.find(params[:id])
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def update
    @exercise= Exercise.find(params[:id])
    if @exercise.update(exercise_params)
---
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "exercises" SET "description" = $1, "updated_at" = $2 WHERE "exercises"."id" = $3  [["description", "Exercise for quads and other muscle in legs"], ["updated_at", "2022-05-04 12:17:01.416674"], ["id", 2]]

  def destroy
    @exercise= Exercise.find_by(id: params[:id])
    @exercise.destroy
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "exercises" WHERE "exercises"."id" = $1  [["id", 9]]