app/controllers/exercises_controller.rb

  def index
    @exercises = (current_user.admin? ? Exercise.all : current_user.exercises)
---
SELECT  "exercises".* FROM "exercises" INNER JOIN "users_exercises" ON "exercises"."id" = "users_exercises"."exercise_id" WHERE "users_exercises"."user_id" = $1 ORDER BY "exercises"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

  def toggle_favourite
    @user_exercise = current_user.user_exercises.find_by(exercise_id: params[:id])
    @user_exercise.update(favourite: params[:type] == 'Favourite')
---
SELECT "user_exercises".* FROM "user_exercises" WHERE "user_exercises"."user_id" = $1 AND "user_exercises"."exercise_id" = $2 LIMIT $3  [["user_id", 828], ["exercise_id", 640], ["LIMIT", 1]]
UPDATE "user_exercises" SET "favourite" = $1 WHERE "user_exercises"."id" = $2  [["favourite", true], ["id", 205]]

  def change_status
    @user_exercises = current_user.current_day_exercises
    @current_user_exercise = current_user.user_exercises.find_by(exercise_id: params[:id])
    @current_user_exercise.update(completed: true)
---
SELECT "user_exercises".* FROM "user_exercises" WHERE "user_exercises"."user_id" = $1 AND "user_exercises"."exercise_id" = $2 LIMIT $3  [["user_id", 662], ["exercise_id", 515], ["LIMIT", 1]]
UPDATE "user_exercises" SET "completed" = $1 WHERE "user_exercises"."id" = $2  [["completed", true], ["id", 173]]

  def set_exercise
    @exercise= Exercise.find_by(id: params[:id])
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 640], ["LIMIT", 1]]