app/controllers/home_controller.rb

  def homepage
    if current_user
      current_exercises= current_user.current_day_exercises
      @diets=[]
      current_exercises.each do |exercise|
---
SELECT  "user_exercises".* FROM "user_exercises" WHERE "user_exercises"."user_id" = $1 AND "user_exercises"."exercise_id" = $2 LIMIT $3  [["user_id", 2], ["exercise_id", 3], ["LIMIT", 1]]