app/controllers/users_controller.rb

SELECT "exercises".* FROM "exercises"
---
  def show
    @Exercises= Exercise.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "user_exercises".* FROM "user_exercises" WHERE "user_exercises"."user_id" = $1 AND "user_exercises"."exercise_id" = $2  [["user_id", 1], ["exercise_id", 9]]
SELECT "exercises".* FROM "exercises" INNER JOIN "user_exercises" ON "exercises"."id" = "user_exercises"."exercise_id" WHERE "user_exercises"."user_id" = $1  [["user_id", 1]]
---
  def manage_exercises
    user= User.find_by(id: params[:id])
    old_exercise_ids= user.exercise_ids.map(&:to_s)
    new_exercise_ids= params[:user][:exercise_ids]
    # Change exercise for user in database
    user.update(exercise_ids: new_exercise_ids)
    # Send mail only if exercises were either added or removed
    if new_exercise_ids.difference(old_exercise_ids).present? || new_exercise_ids.count < old_exercise_ids.count
      UserMailer.with(exercises: new_exercise_ids, email: user.email).user_exercise_update.deliver_now

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_user
    @user= User.find_by(id: params[:id])