app/models/exercise.rb

SELECT  "user_exercises".* FROM "user_exercises" WHERE "user_exercises"."user_id" = $1 AND "user_exercises"."exercise_id" = $2 LIMIT $3  [["user_id", 2], ["exercise_id", 3], ["LIMIT", 1]]
---
  def favourite?(user_id)
    user_exercises.find_by(user_id: user_id).favourite?