app/views/exercises/_exercise_list.html.erb

          <% else %>
          <td class="text-warning lead" style="text-align:end"><%= exercise.users.count %></td>
---
SELECT COUNT(*) FROM "users" INNER JOIN "user_exercises" ON "users"."id" = "user_exercises"."user_id" WHERE "user_exercises"."exercise_id" = $1  [["exercise_id", 19]]