app/views/exercises/show.html.erb

      <h3>Diet</h3>
      <%if @exercise.diets.present? %>
---
SELECT "diets".* FROM "diets" WHERE "diets"."exercise_id" = $1  [["exercise_id", 255]]